/*******************************************************************************
 * Copyright (C) 2011-2013 ZheJiang Dahua Technology CO.,LTD.
 *
 * 文件名 : INTF_CODESW.h
 *
 * 作  者 : 123(ggg)<gg>
 * 版  本 : V1.0.0
 * 日  期 : 2015年4月7日 Create
 *
 * 描  述 : 
 *
 *       1. 硬件说明
 *          无。
 *
 *       2. 程序结构说明。
 *          无。
 *
 *       3. 使用说明。
 *          无。
 *
 *       4. 局限性说明。
 *          无。
 *
 *       5. 其他说明。
 *          无。
 *
 * 修订历史: 
 * 日    期: 
 * 修订版本:
 * 作    者:
 * 修订备注:
 *******************************************************************************/



#ifndef _INTF_CODESW_H_
#define _INTF_CODESW_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */
#include "dh_type.h"


#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */
DH_VOID CODESW_INTF_GPIOInit(DH_VOID);
DH_U8 CODESW_INTF_GetRealStat(DH_VOID);
DH_VOID CODESW_INTF_SaveStatus(DH_U8 u8Data);
DH_U8 CODESW_INTF_GetStatus(DH_VOID);
DH_VOID CODESW_INTF_UpdateSqLevel(DH_VOID);
DH_U8 CODESW_INTF_GetNextCode(DH_U8 adddec);



#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif

